# 基础配置
PLATFORM = "dy"
KEYWORDS = "python,golang"
LOGIN_TYPE = "qrcode"  # qrcode or phone or cookie
COOKIES = ""
SORT_TYPE = "popularity_descending"  # 具体值参见media_platform.xxx.field下的枚举值，展示只支持小红书
CRAWLER_TYPE = (
    "detail"  # 爬取类型，search(关键词搜索) | detail(帖子详情)| creator(创作者主页数据)
)

# 是否开启 IP 代理
ENABLE_IP_PROXY = False

# 代理IP池数量
IP_PROXY_POOL_COUNT = 2

# 代理IP提供商名称
IP_PROXY_PROVIDER_NAME = "kuaidaili"

# 设置为True不会打开浏览器（无头浏览器），设置False会打开一个浏览器（小红书如果一直扫码登录不通过，打开浏览器手动过一下滑动验证码）
HEADLESS = True

# 是否保存登录状态
SAVE_LOGIN_STATE = True

# 数据保存类型选项配置,支持三种类型：csv、db、json
SAVE_DATA_OPTION = "db"  # csv or db or json

# 用户浏览器缓存的浏览器文件配置
USER_DATA_DIR = "%s_user_data_dir"  # %s will be replaced by platform name

# 爬取开始页数 默认从第一页开始
START_PAGE = 1

# 并发爬虫数量控制
MAX_CONCURRENCY_NUM = 4

# 指定抖音需要爬取的ID列表
DY_SPECIFIED_ID_LIST = [
    "7363503764520619273",
    "7363504097695255835",
    "7363599537237200155",
    "7363599301613833499",
    "7363599861037403401",
    "7363600744030768421",
    "7363600939132914954",
    "7363601385759313190",
    "7363601526826208549",
    "7363601903206370586",
    "7363602134295792933",
    "7363602301971336475",
    "7363602487061810459",
    "7363602682998754586",
    "7363603059236162867",
    "7363603655477546291",
    "7363603815607651634",
    "7363604515985165594",
    "7363604846827539763",
    "7363605162474114330",
    "7363605411884289330",
    "7363606245263133990",
    "7363606779340623155",
    "7363607163375209766",
    "7363607306317221147",
    "7363607517122809115",
    "7363607724136877349",
    "7363607864318971146",
    "7363608328389283099",
    "7363614613893696795",
]
